Documents/УведомлениеВладельцаОбОприходованииМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>УведомлениеВладельцаОбОприходованииМДЛП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииОприходованияМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУведомленияВладельцаОбОприходованииМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКонтрагента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаДеятельностиМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоДеятельностиГрузополучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаДеятельностиМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерДокументаМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НомераУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерКИЗ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПодтверждения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеУпаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПодтверждения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/УпаковкиМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>УпаковкиМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерГрупповойУпаковки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрупповаяУпаковка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВложеныПотребительскиеУпаковки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходнаяЗонаТаможенногоКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныТаможенногоКонтроляМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходныйДокументРезерва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаДеятельностиМДЛП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗонаТаможенногоКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныТаможенногоКонтроляМДЛП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияПодтвержденияМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СостоянияПодтвержденияМДЛП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовленоКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненоГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвердить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьПодготовленоКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьПередано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьПринятоГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьОтклоненоГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтозватьПодготовленоКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтозватьПередано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтозваноПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтозватьОтклоненоГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказаться</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказатьсяПодготовленоКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказатьсяПередано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненоПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказатьсяОтклоненоГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненоПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктуализироватьДанныеОбУпаковках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеОбУпаковкахАктуализированы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованоНовымВладельцем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВвезеноВРФБезПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоСОтклонениемОтТребований</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьУведомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьИнвентаризацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УведомлениеВладельцаОбОприходованииМДЛП/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнтеграцияМДЛППереопределяемый.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ВызватьИсключение НСтр("ru = 'Уведомление владельца об оприходовании поддерживает только загрузку. Создание нового документа недоступно.'");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если Не ИнтеграцияМДЛП.ИспользоватьХарактеристикиНоменклатуры() Тогда
		НепроверяемыеРеквизиты.Добавить("Товары.Характеристика");
	КонецЕсли;
	
	Если Не ИнтеграцияМДЛП.ИспользоватьСерииНоменклатуры() Тогда
		НепроверяемыеРеквизиты.Добавить("Товары.Серия");
	КонецЕсли;
	
	ИнтеграцияМДЛППереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	ИнтеграцияМДЛП.ПроверитьВозможностьЗаписиУведомления(ЭтотОбъект, РежимЗаписи);
	
	ИнтеграцияМДЛП.УбратьНезначащиеСимволы(ЭтотОбъект, "НомерДокумента");
	
	ИнтеграцияМДЛППереопределяемый.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияМДЛП.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СтандартнаяОбработка = Истина;
	ИнтеграцияМДЛППереопределяемый.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	НомераУпаковок.НомерКиЗ     КАК НомерУпаковки,
	|	ЛОЖЬ                        КАК ГрупповаяУпаковка,
	|	НомераУпаковок.НомерСтроки  КАК НомерСтроки,
	|	""НомераУпаковок""          КАК ИмяТабличнойЧасти,
	|	""НомерКиЗ""                КАК ИмяПоля
	|ПОМЕСТИТЬ ПодтвержденныеУпаковки
	|ИЗ
	|	Документ.УведомлениеВладельцаОбОприходованииМДЛП.НомераУпаковок КАК НомераУпаковок
	|ГДЕ
	|	НомераУпаковок.Ссылка = &Ссылка
	|	И НомераУпаковок.СостояниеПодтверждения В (
	|		ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОприходованоНовымВладельцем))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НомераУпаковок.НомерУпаковки  КАК НомерУпаковки,
	|	ИСТИНА                        КАК ГрупповаяУпаковка,
	|	НомераУпаковок.НомерСтроки    КАК НомерСтроки,
	|	""ТранспортныеУпаковки""      КАК ИмяТабличнойЧасти,
	|	""НомерУпаковки""             КАК ИмяПоля
	|ИЗ
	|	Документ.УведомлениеВладельцаОбОприходованииМДЛП.ТранспортныеУпаковки КАК НомераУпаковок
	|ГДЕ
	|	НомераУпаковок.Ссылка = &Ссылка
	|	И НомераУпаковок.СостояниеПодтверждения В (
	|		ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОприходованоНовымВладельцем))
	|");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МестоДеятельности", МестоДеятельности);
	Запрос.УстановитьПараметр("ПустаяГрупповаяУпаковка", Метаданные.ОпределяемыеТипы.SSCC.Тип.ПривестиЗначение());
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	ИнтеграцияМДЛП.ДобавитьКлючиУпаковок(Запрос.МенеджерВременныхТаблиц, "ПодтвержденныеУпаковки");
	
	// ИнтеграцияМДЛП.Инвентаризация
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияМДЛП.Инвентаризация") Тогда
		
		ПараметрыОперации = ИнтеграцияМДЛП.ПараметрыОперацииИзмененияСтатусаУпаковок();
		ПараметрыОперации.МестоДеятельности = МестоДеятельности;
		ПараметрыОперации.ДокументРезерва = Ссылка;
		
		МодульИнвентаризацияМДЛП = ОбщегоНазначения.ОбщийМодуль("ИнвентаризацияМДЛП");
		МодульИнвентаризацияМДЛП.ПоместитьДанныеВТаблицуНомераУпаковок(Запрос.МенеджерВременныхТаблиц, "ПодтвержденныеУпаковки");
		ПроверкаПройдена = МодульИнвентаризацияМДЛП.ПроверитьДоступностьУпаковок(Запрос.МенеджерВременныхТаблиц, ПараметрыОперации, Отказ);
		Если Не ПроверкаПройдена Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	// Конец ИнтеграцияМДЛП.Инвентаризация
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеУпаковок.НомерУпаковки           КАК НомерУпаковки,
	|	ДанныеУпаковок.КлючУпаковки            КАК КлючУпаковки,
	|	ДанныеУпаковок.МестоДеятельности       КАК МестоДеятельности,
	|	ДанныеУпаковок.НомерГрупповойУпаковки  КАК НомерГрупповойУпаковки,
	|	ДанныеУпаковок.ДокументРезерва         КАК ДокументРезерва,
	|	ДанныеУпаковок.ГрупповаяУпаковка       КАК ГрупповаяУпаковка
	|ПОМЕСТИТЬ ДанныеУпаковок
	|ИЗ
	|	РегистрСведений.УпаковкиМДЛП КАК ДанныеУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ПодтвержденныеУпаковки КАК ПодтвержденныеУпаковки
	|		ПО
	|			ПодтвержденныеУпаковки.НомерУпаковки = ДанныеУпаковок.НомерУпаковки
	|			И ПодтвержденныеУпаковки.КлючУпаковки = ДанныеУпаковок.КлючУпаковки
	|			И ДанныеУпаковок.МестоДеятельности = &МестоДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Родительские упаковки самого верхнего уровня. Необходимы в случае если в 702 было использовано автоизъятие.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РодительскиеУпаковкиСамогоВерхнегоУровня.НомерУпаковки      КАК НомерУпаковки,
	|	РодительскиеУпаковкиСамогоВерхнегоУровня.КлючУпаковки       КАК КлючУпаковки,
	|	РодительскиеУпаковкиСамогоВерхнегоУровня.МестоДеятельности  КАК МестоДеятельности
	|ПОМЕСТИТЬ РодительскиеУпаковкиСамогоВерхнегоУровня
	|ИЗ
	|	ДанныеУпаковок КАК ДанныеУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			РегистрСведений.УпаковкиМДЛП КАК РодительскиеУпаковкиСамогоВерхнегоУровня
	|		ПО
	|			РодительскиеУпаковкиСамогоВерхнегоУровня.НомерУпаковки = ДанныеУпаковок.ДокументРезерва
	|			И РодительскиеУпаковкиСамогоВерхнегоУровня.МестоДеятельности = &МестоДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Родительские упаковки самого верхнего уровня.
	|ВЫБРАТЬ
	|	РодительскиеУпаковкиСамогоВерхнегоУровня.НомерУпаковки      КАК НомерУпаковки,
	|	РодительскиеУпаковкиСамогоВерхнегоУровня.КлючУпаковки       КАК КлючУпаковки,
	|	РодительскиеУпаковкиСамогоВерхнегоУровня.МестоДеятельности  КАК МестоДеятельности,
	|	ЛОЖЬ                                                        КАК КСписанию
	|ИЗ
	|	РодительскиеУпаковкиСамогоВерхнегоУровня КАК РодительскиеУпаковкиСамогоВерхнегоУровня
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Вложенные упаковки.
	|ВЫБРАТЬ
	|	ВложенныеУпаковки.НомерУпаковки            КАК НомерУпаковки,
	|	ВложенныеУпаковки.КлючУпаковки             КАК КлючУпаковки,
	|	ВложенныеУпаковки.МестоДеятельности        КАК МестоДеятельности,
	|	ВложенныеУпаковки.НомерГрупповойУпаковки   КАК НомерГрупповойУпаковки,
	|	ВложенныеУпаковки.ДокументРезерва          КАК ДокументРезерва,
	|	ВложенныеУпаковки.ГрупповаяУпаковка        КАК ГрупповаяУпаковка,
	|	НЕ ДанныеУпаковок.НомерУпаковки ЕСТЬ NULL  КАК КСписанию
	|ИЗ
	|	РодительскиеУпаковкиСамогоВерхнегоУровня КАК РодительскиеУпаковкиСамогоВерхнегоУровня
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			РегистрСведений.УпаковкиМДЛП КАК ВложенныеУпаковки
	|				ЛЕВОЕ СОЕДИНЕНИЕ
	|					ДанныеУпаковок КАК ДанныеУпаковок
	|				ПО
	|					ДанныеУпаковок.НомерУпаковки = ВложенныеУпаковки.НомерУпаковки
	|					И ДанныеУпаковок.КлючУпаковки = ВложенныеУпаковки.КлючУпаковки
	|		ПО
	|			ВложенныеУпаковки.ДокументРезерва = РодительскиеУпаковкиСамогоВерхнегоУровня.НомерУпаковки
	|			И ВложенныеУпаковки.МестоДеятельности = &МестоДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Упаковки без родителей: потребительские упаковки или групповые упаковки самого верхнего уровня, у которых все вложенные упаковки можно списать без проверки.
	|ВЫБРАТЬ
	|	ДанныеУпаковок.НомерУпаковки      КАК НомерУпаковки,
	|	ДанныеУпаковок.КлючУпаковки       КАК КлючУпаковки,
	|	ДанныеУпаковок.МестоДеятельности  КАК МестоДеятельности,
	|	ДанныеУпаковок.ГрупповаяУпаковка  КАК ГрупповаяУпаковка
	|ИЗ
	|	ДанныеУпаковок КАК ДанныеУпаковок
	|ГДЕ
	|	ДанныеУпаковок.НомерГрупповойУпаковки = &ПустаяГрупповаяУпаковка
	|";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОтразитьСписание = Результат[Результат.ВГраница()].Выбрать();
	Пока ОтразитьСписание.Следующий() Цикл
		Если ОтразитьСписание.ГрупповаяУпаковка Тогда
			УдалитьУпаковки = РегистрыСведений.УпаковкиМДЛП.СоздатьНаборЗаписей();
			УдалитьУпаковки.Отбор.ДокументРезерва.Установить(ОтразитьСписание.НомерУпаковки);
			УдалитьУпаковки.Отбор.МестоДеятельности.Установить(ОтразитьСписание.МестоДеятельности);
			УдалитьУпаковки.Записать();
		КонецЕсли;
		ОтразитьСписание(ОтразитьСписание);
	КонецЦикла;
	
	ДанныеРодителей = Результат[Результат.ВГраница() - 2].Выгрузить();
	ДанныеВложенных = Результат[Результат.ВГраница() - 1].Выгрузить();
	
	Для Каждого СтрокаРодителя Из ДанныеРодителей Цикл
		ОтразитьСписаниеРекурсивно(СтрокаРодителя, ДанныеВложенных);
		Если СтрокаРодителя.КСписанию Тогда
			ОтразитьСписание(СтрокаРодителя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	СтандартнаяОбработка = Истина;
	ИнтеграцияМДЛППереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияМДЛП.ОтменитьРезерв(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтразитьСписаниеРекурсивно(СтрокаРодителя, ДанныеВложенных)
	
	КСписанию = Истина;
	
	НайденныеВложенные = ДанныеВложенных.НайтиСтроки(Новый Структура("НомерГрупповойУпаковки", СтрокаРодителя.НомерУпаковки));
	Для Каждого СтрокаВложенного Из НайденныеВложенные Цикл
		
		Если СтрокаРодителя.КСписанию Тогда
			СтрокаВложенного.КСписанию = Истина;
		КонецЕсли;
		
		Если СтрокаВложенного.ГрупповаяУпаковка Тогда
			ОтразитьСписаниеРекурсивно(СтрокаВложенного, ДанныеВложенных);
			Если СтрокаВложенного.КСписанию Тогда
				ОтразитьСписание(СтрокаВложенного);
			КонецЕсли;
		Иначе
			Если СтрокаВложенного.КСписанию Тогда
				ОтразитьСписание(СтрокаВложенного);
			КонецЕсли;
		КонецЕсли;
		
		КСписанию = КСписанию И СтрокаВложенного.КСписанию;
		
	КонецЦикла;
	
	СтрокаРодителя.КСписанию = КСписанию;
	
КонецПроцедуры

Процедура ОтразитьСписание(Данные)
	
	УдалитьУпаковки = РегистрыСведений.УпаковкиМДЛП.СоздатьНаборЗаписей();
	УдалитьУпаковки.Отбор.НомерУпаковки.Установить(Данные.НомерУпаковки);
	УдалитьУпаковки.Отбор.КлючУпаковки.Установить(Данные.КлючУпаковки);
	УдалитьУпаковки.Отбор.МестоДеятельности.Установить(Данные.МестоДеятельности);
	УдалитьУпаковки.Записать();
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
